lvx/base/Catalogs/бит_КлючиСценарийЦФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_КлючиСценарийЦФО</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаЗапретаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыЗапретаИзмененияДанныхБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_КлючиСценарийЦФО/Forms/ЗаполнениеКлючей/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сценарий = Параметры.Сценарий;
	
	УстановитьУсловноеОформление();	
	ЗаполнитьСписокЦФО();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Список.ПолучитьЭлементы().Количество() = 0 Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список" , "Заполнение",,, НСтр("ru = 'Список ЦФО'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Список", ,Отказ); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	ПеречитатьСписокНаСервере();
	бит_РаботаСДиалогамиКлиент.РазвернутьДоУровня(Элементы.Список, Список, 10);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокИспользоватьПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Стек = Новый Массив; 
	Для каждого СтрокаТаблицы Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
		
		Стек.Добавить(СтрокаТаблицы);
	
		Пока Стек.Количество() > 0 Цикл
			
			ТекущийОбъект = Стек.Получить(Стек.ВГраница());
			Стек.Удалить(Стек.ВГраница());
			
			ТекущийОбъект.Использовать = ТекущаяСтрока.Использовать;
			Для каждого Элемент Из ТекущийОбъект.ПолучитьЭлементы() Цикл
				Стек.Добавить(Элемент);
			КонецЦикла; 
		КонецЦикла;
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеречитатьСписок(Команда)
	
	Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
		ОчиститьСообщения();
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ" , "Заполнение", НСтр("ru = 'Сценарий'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Сценарий"); 
	КонецЕсли;
	
	ПеречитатьСписокНаСервере();
	бит_РаботаСДиалогамиКлиент.РазвернутьДоУровня(Элементы.Список, Список, 10);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ЗаписатьНаСервере();
		бит_РаботаСДиалогамиКлиент.РазвернутьДоУровня(Элементы.Список, Список, 10);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокЦФО()
	
	Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
		Возврат;
	КонецЕсли;
	
	Список.ПолучитьЭлементы().Очистить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Подразделения.Ссылка КАК ЦФО,
	|	ВЫБОР
	|		КОГДА НЕ СписокЦФО.ЦФО ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Использовать,
	|	ВЫБОР
	|		КОГДА НЕ СписокЦФО.ЦФО ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Существует
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_КлючиСценарийЦФО КАК СписокЦФО
	|		ПО Подразделения.Ссылка = СписокЦФО.ЦФО
	|			И (СписокЦФО.Сценарий = &Сценарий)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦФО ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
				   
	Результат = Запрос.Выполнить();
	ЗначениеВРеквизитФормы(Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией), "Список");
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста 
Процедура УправлениеФормой(Форма)


КонецПроцедуры

&НаСервере
Процедура ПеречитатьСписокНаСервере()
	
	ЗаполнитьСписокЦФО();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Дерево = РеквизитФормыВЗначение("Список");
	ДанныеКлючей = Новый Массив; 
	
	Стек = Новый Массив; 
	Для каждого СтрокаТаблицы Из Дерево.Строки Цикл
		
		Стек.Добавить(СтрокаТаблицы);
	
		Пока Стек.Количество() > 0 Цикл
			
			ТекущийОбъект = Стек.Получить(Стек.ВГраница());
			Стек.Удалить(Стек.ВГраница());
			
			Если ТекущийОбъект.Использовать И НЕ ТекущийОбъект.Существует Тогда
				ДанныеКлючей.Добавить(ТекущийОбъект.ЦФО);			
			КонецЕсли;
			
			Для каждого Элемент Из ТекущийОбъект.Строки Цикл
				Стек.Добавить(Элемент);
			КонецЦикла; 
		КонецЦикла;
	КонецЦикла; 

	Для каждого ЦФО Из ДанныеКлючей Цикл
		РеквизитыКлюча = Новый Структура("Сценарий, ЦФО", Сценарий, ЦФО); 
		Справочники.бит_КлючиСценарийЦФО.КлючиСценарийЦФОДокумента(РеквизитыКлюча);	
	КонецЦикла; 
	
	ПеречитатьСписокНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокИспользовать");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Список.Существует", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

КонецПроцедуры
 
#КонецОбласти
